# 4. Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.
print('Этот скрипт занимается вычеслениями по ТЗ - находит самую большую цифру в числе')
# n = int(input('Введите целое положительное число: '))
print("{:.3f}".format(5.0/3))
